"USSD_ERROR" = "Erro ao efectuar pedido";
"USSD_TERMINATED" = "Sessão terminada";

"%@ Call Forwarding\n%@\n%@%@" = "Reencaminhamento de chamadas:%@\n%@\n%@%@";
"%@ Call Waiting\n%@" = "Chamadas em espera:%@\n%@";
"%@ Call Barring\n%@\n%@" = "Barramento de chamadas:%@\n%@\n%@";
"%@ Fixed Dialing\n%@" = "Marcação fixa:%@\n%@";
"Connected Line Presentation\n%@" = "Identificação da linha ligada\n%@";
"Calling Line Presentation\n%@" = "Identificação da linha de chamada\n%@";
"Connected Line ID Restriction\n%@" = "Restrição de identificação da linha ligada\n%@";
"Calling Line ID Restriction\n%@" = "Restrição de identificação de linha de chamada\n%@";
"SIM Lock\n%@" = "Bloqueio do SIM\n%@";
"Service Center Address\n%@" = "Endereço do centro de serviço\n%@";
"Supplementary Service Password\n%@" = "Palavra‑passe de serviço suplementar\n%@";
"Calling Name Presentation\n%@" = "Identificação do nome\n%@";

"Forwards to %@\n" = "Reenvia para %@\n";

"All Calls" = "Todas as chamadas";
"All Conditional Calls" = "Todas as chamadas condicionais";
"Async Data Circuit" = "Circuito de dados assíncronos";
"Data" = "Dados";
"Fax" = "Fax";
"Packet Access" = "Acesso ao pacote";
"Pad Access" = "Acesso ao teclado";
"SMS" = "sms";
"Sync Data Circuit" = "Circuito de dados síncronos";
"Voice" = "Voz";

"All Outgoing" = "Envio: todos";
"All Incoming" = "Recepção: todos";
"Outgoing International" = "Envio internacional";
"Outgoing International, Except Home Country" = "Envio internacional, excepto país de origem";
"Incoming While Roaming Outside Home Country" = "Recepção, em roaming fora do país de origem";
"Incoming, Not On SIM" = "Recepção, sem estar no SIM";
"All Services" = "Todos os serviços";
"All Outgoing Services" = "Serviços de envio: todos";
"All Incoming Services" = "Serviços de recepção: todos";

"Disabled" = "Desactivado";
"Enabled" = "Activo";

"On All Calls" = "Em todas as chamadas";
"When Busy" = "Quando ocupado";
"When Unanswered" = "Quando não atendido";
"When Unreachable" = "Quando inacessível";

"Setting %@ Succeeded" = "%@ da definição bem sucedida\n";
"Setting Interrogation Succeeded" = "A consulta da definição foi bem sucedida\n";
"Setting %@ Failed" = "%@ da definição falhou\n";
"Setting Interrogation Failed" = "A consulta da definição falhou\n";

"Not Available" = "Indisponível";
"Network Controlled" = "Rede controlada";
"Temporarily Disabled" = "Temporariamente desactivado";
"Temporarily Enabled" = "Temporariamente activado";
"Unknown" = "Desconhecido";

"Activation" = "A activação";
"Deactivation" = "A desactivação";
"Interrogation" = "A interrogação";
"Registration" = "O registo";
"Erasure" = "A eliminação";

"No Address" = "Endereço inexistente";
"No Service Specified" = "Nenhum serviço especificado";
"Type %d" = "Tipo %d";

// generic error
"CALL_FAILED" = "A chamada falhou";
// error codes
"kCTNoError" = "Não há erros";
"kCTUnknownError" = "Erro desconhecido";
"kCTErrorRadioFailure" = "Falha do rádio";
// Generic network errors
"kCTErrorNetworkFailure" = "Falha da rede";
"kCTErrorCongestion" = "Rede congestionada";
"kCTErrorUnidentifiedSubscriber" = "Subscritor não identificado";
"kCTErrorFacilityRejected" = "Recurso rejeitado";
"kCTErrorUnknownSubscriber" = "Subscritor desconhecido";
"kCTErrorNetworkOutOfOrder" = "Rede fora de serviço";
"kCTErrorInvalidTransactionIdentifier" = "Identificador de transacção inválido";
"kCTErrorSemanticallyIncorrectMessage" = "Mensagem semanticamente incorrecta";
"kCTErrorInvalidMandatoryInformation" = "Informação obrigatória inválida";
"kCTErrorMessageTypeNonExistant" = "Tipo de mensagem inexistente";
"kCTErrorMessageNotCompatibleWithProtocolState" = "Mensagem incompatível com estado de protocolo";
"kCTErrorInformationElementNonExistant" = "Elemento de informação inexistente";
"kCTErrorProtocolErrorUnspecified" = "Erro indeterminado de protocolo";
"kCTErrorTemporaryFailure" = "Falha temporária";
"kCTErrorResourcesUnavailable" = "Recursos indisponíveis";
"kCTErrorRequestedFacilityNotSubscribed" = "Recurso solicitado não subscrito";
"kCTErrorRequestedFacilityNotImplemented" = "Recurso solicitado não implementado";
"kCTErrorInterworkingError" = "Erro de interoperação";
"kCTErrorInterworkingNotSupported" = "Interoperação não suportada";
"kCTErrorCommandCannotBeActioned" = "O comando não pode ser processado";
"kCTErrorNoNetworkService" = "Serviço de rede inexistente";
// Call related errors
"kCTErrorUnassignedNumber" = "Número não atribuído";
"kCTErrorOperatorDeterminedBarring" = "Barramento determinado pela operadora";
"kCTErrorCallBarred" = "Chamada bloqueada";
"kCTErrorUserBusy" = "Número ocupado";
"kCTErrorNoUserResponding" = "Sem resposta do utilizador";
"kCTErrorNumberChanged" = "Número alterado";
"kCTErrorInvalidNumberFormat" = "Formato de número inválido";
"kCTErrorCallRejected" = "Chamada rejeitada";
// SIM errors
"kCTErrorSimNotInserted" = "SIM não inserido";
"kCTErrorSimPinRequired" = "Requer PIN do SIM";
"kCTErrorSimPukRequired" = "Requer PUK do SIM";
"kCTErrorSimFailure" = "Falha do SIM";
"kCTErrorSimMemoryFailure" = "Falha de memória do SIM";
"kCTBadPinFormatError" = "Formato do PIN incorrecto";
"kCTErrorNumberNotAllowed" = "Número não permitido";
"kCTErrorIncorrectPassword" = "Palavra‑passe incorrecta";
// SMS Errors
"kCTErrorShortMessageTransferRejected" = "Transferência de mensagem curta rejeitada";
"kCTErrorDestinationOutOfOrder" = "Destino fora de serviço";
"kCTErrorClass0NotSupported" = "Classe 0 não suportada";
"kCTErrorCannotReplaceSm" = "O SIM não pode ser substituído";
"kCTErrorUnspecifiedPid" = "PID indeterminado";
"kCTErrorDataCodingSchemeNotSupported" = "Esquema de codificação de dados não suportado";
"kCTErrorUnspecifiedDcs" = "Erro DCS indeterminado";
"kCTErrorCommandUnsupported" = "Comando não suportado";
"kCTErrorUnspecifiedTpCommand" = "Erro indeterminado de comando TP";
"kCTErrorTpduNotSupported" = "TPDU não suportado";
"kCTErrorScBusy" = "SC ocupado";
"kCTErrorRejectedBySimSmsControl" = "Rejeitado pelo controlo de sms do SIM";
// GPRS Errors
"kCTErrorGprsIllegalMs" = "MS ilegal de GPRS";
"kCTErrorGprsIllegalMe" = "ME ilegal de GPRS";
"kCTErrorGprsServicesNotAllowed" = "Serviços GPRS não permitidos";
"kCTErrorGprsPlmnNotAllowed" = "GPRS PLMN não permitido";
"kCTErrorGprsLocationAreaNotAllowed" = "Área de localização GPRS não permitida";
"kCTErrorGprsRoamingNotAllowedInLocationArea" = "Roaming GPRS não permitido na área de localização";
"kCTErrorGprsServiceOptionNotSupported" = "Opção de serviço GPRS não suportada";
"kCTErrorGprsServiceOptionNotSubscribed" = "Opção de serviço GPRS não subscrita";
"kCTErrorGprsServiceOptionTemporarilyOutOfOrder" = "Opção de serviço GPRS temporariamente fora de serviço";
"kCTErrorGprsPdpAuthenticationFailure" = "Falha de autenticação PDP de GPRS";
"kCTErrorGprsInvalidMobileClass" = "Classe móvel inválida de GPRS";
"kCTErrorGprsUnspecified" = "GPRS não especificado";
"kCTErrorGprsMissingorUnknownAPN" = "Falta GPRS ou APN desconhecido";
"kCTErrorGprsPDPAuthenticationInfoRejectedByBaseband" = "Informação de autenticação PDP GPRS rejeitada pela baseband";
